/**
 * Kanada (Kanji-Kana Transliteration Library for Java)
 * Copyright (C) 2002-2014 Masahiko Sato
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, write to the Free Software Foundation, Inc.,
 * 51 Franklin Street, Fifth Floor, Boston, MA 02110-1301 USA.
 */
package com.iciao.kanada.maps;

import com.iciao.kanada.j_mapper;

import java.util.HashMap;

/**
 * Remap non-kanji characters.<br>
 *
 * @author Masahiko Sato
 */

/**
5th Block \245: Katakana
     ０ １ ２ ３ ４ ５ ６ ７ ０ １ ２ ３ ４ ５ ６ ７
\240 　 ァ ア ィ イ ゥ ウ ェ エ ォ オ カ ガ キ ギ ク
\260 グ ケ ゲ コ ゴ サ ザ シ ジ ス ズ セ ゼ ソ ゾ タ
\300 ダ チ ヂ ッ ツ ヅ テ デ ト ド ナ ニ ヌ ネ ノ ハ
\320 バ パ ヒ ビ ピ フ ブ プ ヘ ベ ペ ホ ボ ポ マ ミ
\340 ム メ モ ャ ヤ ュ ユ ョ ヨ ラ リ ル レ ロ ヮ ワ
\360 ヰ ヱ ヲ ン ヴ ヵ ヶ
 */
public class map_katakana extends j_mapper {
    private static final String katakana_to_romaji[] = {
            "\245\241", "a",
            "\245\242", "a",
            "\245\243", "i",
            "\245\244", "i",
            "\245\244\245\247", "ye",
            "\245\245", "u",
            "\245\246", "u",
            "\245\247", "e",
            "\245\250", "e",
            "\245\251", "o",
            "\245\252", "o",

            "\245\253", "ka",
            "\245\254", "ga",
            "\245\255", "ki",
            "\245\255\245\243", "ki",
            "\245\255\245\247", "kye",
            "\245\255\245\343", "kya",
            "\245\255\245\345", "kyu",
            "\245\255\245\347", "kyo",
            "\245\256", "gi",
            "\245\256\245\243", "gi",
            "\245\256\245\247", "gye",
            "\245\256\245\343", "gya",
            "\245\256\245\345", "gyu",
            "\245\256\245\347", "gyo",
            "\245\257", "ku",
            "\245\257\245\241", "kwa",
            "\245\257\245\243", "kwi",
            "\245\257\245\245", "ku",
            "\245\257\245\247", "kwe",
            "\245\257\245\251", "kwo",
            "\245\260", "gu",
            "\245\260\245\241", "gwa",
            "\245\260\245\243", "gwi",
            "\245\260\245\245", "gu",
            "\245\260\245\247", "gwe",
            "\245\260\245\251", "gwo",
            "\245\261", "ke",
            "\245\262", "ge",
            "\245\263", "ko",
            "\245\264", "go",

            "\245\265", "sa",
            "\245\266", "za",
            "\245\267", "si",
            "\245\267\245\243", "si",
            "\245\267\245\247", "sye",
            "\245\267\245\343", "sya",
            "\245\267\245\345", "syu",
            "\245\267\245\347", "syo",
            "\245\270", "zi",
            "\245\270\245\243", "zi",
            "\245\270\245\247", "zye",
            "\245\270\245\343", "zya",
            "\245\270\245\345", "zyu",
            "\245\270\245\347", "zyo",
            "\245\271", "su",
            "\245\272", "zu",
            "\245\273", "se",
            "\245\274", "ze",
            "\245\275", "so",
            "\245\276", "zo",

            "\245\277", "ta",
            "\245\300", "da",
            "\245\301", "ti",
            "\245\301\245\243", "ti",
            "\245\301\245\247", "tye",
            "\245\301\245\343", "tya",
            "\245\301\245\345", "tyu",
            "\245\301\245\347", "tyo",
            "\245\302", "zi",
            "\245\302\245\243", "zi",
            "\245\302\245\247", "zye",
            "\245\302\245\343", "zya",
            "\245\302\245\345", "zyu",
            "\245\302\245\347", "zyo",

            "\245\303", "tu",
            "\245\303\245\253", "kka",
            "\245\303\245\254", "gga",
            "\245\303\245\255", "kki",
            "\245\303\245\255\245\243", "kki",
            "\245\303\245\255\245\247", "kkye",
            "\245\303\245\255\245\343", "kkya",
            "\245\303\245\255\245\345", "kkyu",
            "\245\303\245\255\245\347", "kkyo",
            "\245\303\245\256", "ggi",
            "\245\303\245\256\245\243", "ggi",
            "\245\303\245\256\245\247", "ggye",
            "\245\303\245\256\245\343", "ggya",
            "\245\303\245\256\245\345", "ggyu",
            "\245\303\245\256\245\347", "ggyo",
            "\245\303\245\257", "kku",
            "\245\303\245\260", "ggu",
            "\245\303\245\261", "kke",
            "\245\303\245\262", "gge",
            "\245\303\245\263", "kko",
            "\245\303\245\264", "ggo",
            "\245\303\245\265", "ssa",
            "\245\303\245\266", "zza",
            "\245\303\245\267", "ssi",
            "\245\303\245\267\245\243", "ssi",
            "\245\303\245\267\245\247", "ssye",
            "\245\303\245\267\245\343", "ssya",
            "\245\303\245\267\245\345", "ssyu",
            "\245\303\245\267\245\347", "ssyo",
            "\245\303\245\270", "zzi",
            "\245\303\245\270\245\243", "zzi",
            "\245\303\245\270\245\247", "zzye",
            "\245\303\245\270\245\343", "zzya",
            "\245\303\245\270\245\345", "zzyu",
            "\245\303\245\270\245\347", "zzyo",
            "\245\303\245\271", "ssu",
            "\245\303\245\272", "zzu",
            "\245\303\245\273", "sse",
            "\245\303\245\274", "zze",
            "\245\303\245\275", "sso",
            "\245\303\245\276", "zzo",
            "\245\303\245\277", "tta",
            "\245\303\245\300", "dda",
            "\245\303\245\301", "tti",
            "\245\303\245\301\245\243", "tti",
            "\245\303\245\301\245\247", "ttye",
            "\245\303\245\301\245\343", "ttya",
            "\245\303\245\301\245\345", "ttyu",
            "\245\303\245\301\245\347", "ttyo",
            "\245\303\245\302", "zzi",
            "\245\303\245\302\245\243", "zzi",
            "\245\303\245\302\245\247", "zzye",
            "\245\303\245\302\245\343", "zzya",
            "\245\303\245\302\245\345", "zzyu",
            "\245\303\245\302\245\347", "zzyo",
            "\245\303\245\304", "ttu",
            "\245\303\245\305", "zzu",
            "\245\303\245\306", "tte",
            "\245\303\245\307", "dde",
            "\245\303\245\310", "tto",
            "\245\303\245\311", "ddo",
            "\245\303\245\317", "hha",
            "\245\303\245\320", "bba",
            "\245\303\245\321", "ppa",
            "\245\303\245\322", "hhi",
            "\245\303\245\322\245\243", "hhi",
            "\245\303\245\322\245\247", "hhye",
            "\245\303\245\322\245\343", "hhya",
            "\245\303\245\322\245\345", "hhyu",
            "\245\303\245\322\245\347", "hhyo",
            "\245\303\245\323", "bbi",
            "\245\303\245\323\245\243", "bbi",
            "\245\303\245\323\245\247", "bbye",
            "\245\303\245\323\245\343", "bbya",
            "\245\303\245\323\245\345", "bbyu",
            "\245\303\245\323\245\347", "bbyo",
            "\245\303\245\324", "ppi",
            "\245\303\245\324\245\243", "ppi",
            "\245\303\245\324\245\247", "ppye",
            "\245\303\245\324\245\343", "ppya",
            "\245\303\245\324\245\345", "ppyu",
            "\245\303\245\324\245\347", "ppyo",
            "\245\303\245\325", "hhu",
            "\245\303\245\325\245\241", "hhwa",
            "\245\303\245\325\245\243", "hhwi",
            "\245\303\245\325\245\245", "hhu",
            "\245\303\245\325\245\247", "hhwe",
            "\245\303\245\325\245\251", "hhwo",
            "\245\303\245\326", "bbu",
            "\245\303\245\327", "ppu",
            "\245\303\245\330", "hhe",
            "\245\303\245\331", "bbe",
            "\245\303\245\332", "ppe",
            "\245\303\245\333", "hho",
            "\245\303\245\334", "bbo",
            "\245\303\245\335", "ppo",
            "\245\303\245\344", "yya",
            "\245\303\245\346", "yyu",
            "\245\303\245\350", "yyo",
            "\245\303\245\351", "rra",
            "\245\303\245\352", "rri",
            "\245\303\245\352\245\343", "rrya",
            "\245\303\245\352\245\345", "rryu",
            "\245\303\245\352\245\347", "rryo",
            "\245\303\245\353", "rru",
            "\245\303\245\354", "rre",
            "\245\303\245\355", "rro",
            "\245\303\245\364", "vvu",
            "\245\303\245\364\245\241", "vva",
            "\245\303\245\364\245\243", "vvi",
            "\245\303\245\364\245\247", "vve",
            "\245\303\245\364\245\251", "vvo",

            "\245\304", "tu",
            "\245\304\245\241", "twa",
            "\245\304\245\243", "twi",
            "\245\304\245\245", "tu",
            "\245\304\245\247", "twe",
            "\245\304\245\251", "two",
            "\245\305", "zu",
            "\245\306", "te",
            "\245\306\245\345", "twyu",
            "\245\307", "de",
            "\245\307\245\345", "dwyu",
            "\245\310", "to",
            "\245\311", "do",

            "\245\312", "na",
            "\245\313", "ni",
            "\245\313\245\243", "ni",
            "\245\313\245\247", "nye",
            "\245\313\245\343", "nya",
            "\245\313\245\345", "nyu",
            "\245\313\245\347", "nyo",
            "\245\314", "nu",
            "\245\315", "ne",
            "\245\316", "no",

            "\245\317", "ha",
            "\245\320", "ba",
            "\245\321", "pa",
            "\245\322", "hi",
            "\245\322\245\243", "hi",
            "\245\322\245\247", "hye",
            "\245\322\245\343", "hya",
            "\245\322\245\345", "hyu",
            "\245\322\245\347", "hyo",
            "\245\323", "bi",
            "\245\323\245\243", "bi",
            "\245\323\245\247", "bye",
            "\245\323\245\343", "bya",
            "\245\323\245\345", "byu",
            "\245\323\245\347", "byo",
            "\245\324", "pi",
            "\245\324\245\243", "pi",
            "\245\324\245\247", "pye",
            "\245\324\245\343", "pya",
            "\245\324\245\345", "pyu",
            "\245\324\245\347", "pyo",
            "\245\325", "hu",
            "\245\325\245\241", "hwa",
            "\245\325\245\243", "hwi",
            "\245\325\245\245", "hu",
            "\245\325\245\247", "hwe",
            "\245\325\245\251", "hwo",
            "\245\325\245\345", "hwyu",
            "\245\326", "bu",
            "\245\327", "pu",
            "\245\330", "he",
            "\245\331", "be",
            "\245\332", "pe",
            "\245\333", "ho",
            "\245\334", "bo",
            "\245\335", "po",

            "\245\336", "ma",
            "\245\337", "mi",
            "\245\337\245\243", "mi",
            "\245\337\245\247", "mye",
            "\245\337\245\343", "mya",
            "\245\337\245\345", "myu",
            "\245\337\245\347", "myo",
            "\245\340", "mu",
            "\245\341", "me",
            "\245\342", "mo",

            "\245\343", "ya",
            "\245\344", "ya",
            "\245\345", "yu",
            "\245\346", "yu",
            "\245\347", "yo",
            "\245\350", "yo",

            "\245\351", "ra",
            "\245\352", "ri",
            "\245\352\245\243", "ri",
            "\245\352\245\247", "rye",
            "\245\352\245\343", "rya",
            "\245\352\245\345", "ryu",
            "\245\352\245\347", "ryo",
            "\245\353", "ru",
            "\245\354", "re",
            "\245\355", "ro",

            "\245\356", "wa",
            "\245\357", "wa",
            "\245\360", "i",
            "\245\361", "e",
            "\245\362", "o",
            "\245\363", "n",

            "\245\363\245\242", "n'a",
            "\245\363\245\244", "n'i",
            "\245\363\245\246", "n'u",
            "\245\363\245\250", "n'e",
            "\245\363\245\252", "n'o",

            "\245\364", "vu",
            "\245\364\245\241", "va",
            "\245\364\245\243", "vi",
            "\245\364\245\247", "ve",
            "\245\364\245\251", "vo",
            "\245\364\245\343", "vya",
            "\245\364\245\345", "vyu",
            "\245\364\245\347", "vyo",

            "\245\365", "ka",
            "\245\366", "ke",

            "", ""};

    private static final HashMap<String, String> katakana_to_romaji_map;
    static {
        katakana_to_romaji_map = new HashMap<String, String>(katakana_to_romaji.length);
        for (int i = 0; i < katakana_to_romaji.length; i += 2) {
            String key = katakana_to_romaji[i];
            String value = katakana_to_romaji[i + 1];
            katakana_to_romaji_map.put(key, value);
        }
    }

    public map_katakana() {
        this(0, null);
    }

    protected map_katakana(int count, String str) {
        super(count, str);
    }

    protected void process(String str, int param) {
        int i = 0;
        StringBuilder out = new StringBuilder();

        switch (param) {
            case TO_HIRAGANA: {
                char first_char = (char) (str.charAt(0) - 0x01);
                char second_char = str.charAt(1);

                if (first_char == 0xa5 && second_char > 0xf3) {
                    switch (second_char) {
                        case 0xf4: {
                            second_char = 0xd6;
                            break;
                        }
                        case 0xf5: {
                            second_char = 0xab;
                            break;
                        }
                        case 0xf6: {
                            second_char = 0xb1;
                            break;
                        }
                    }
                }

                out.append(first_char).append(second_char);
                i = 2;
                break;
            }
            case TO_HALF_KATAKANA: {
                char first_char = str.charAt(0);
                char second_char = str.charAt(1);
                out.append(first_char).append(second_char);
                i = 2;
                break;
            }

            case TO_ASCII:
            case TO_WIDE_ASCII: {
//				Iterator	iterater	= katakana_to_romaji_map.keySet().iterator();
//				String	romaji	= "?";
//				int matched_len = 0;
//				while ( iterater.hasNext() )
//				{
//					String	key		= (String)iterater.next();
//					int		key_len	= key.length();
//					if ( key_len > str.length() )
//					{
//						continue;
//					}
//					String	kana	= str.substring(0, key_len);
//
//					if ( key.equals(kana) && matched_len < key_len )
//					{
//						romaji	= (String)kanada_def.katakana_to_romaji_map.get(key);
//						matched_len		= key_len;
//					}
//				}
//				i = matched_len > 0 ? matched_len : 2;

                i = str.length() > 6 ? 6 : str.length();
                if (i % 2 == 1) {
                    --i;
                }
                String romaji = "";
                while (i > 1) {
                    String kana = str.substring(0, i);
                    if (katakana_to_romaji_map.containsKey(kana)) {
                        romaji = katakana_to_romaji_map.get(kana);
                        break;
                    }
                    i = i - 2;
                }
                out.append(romaji);
                break;
            }
            default: {
                char first_char = str.charAt(0);
                char second_char = str.charAt(1);
                out.append(first_char).append(second_char);
                i = 2;
                break;
            }
        }

        set_int(i);
        set_string(out.toString());
    }
}
